backend/views/producto/registro.php

            <div class="col-lg-12">
                <?php
                $form = ActiveForm::begin();
                $model = \backend\models\Producto::find()->andFilterWhere(['=', 'category_id', 12])->one();
                echo "<h1>Elige la categoría a mostrar</h1>";
                echo "<div class='col-sm-6'>" . $form->field($model, 'category_id')->widget(\kartik\select2\Select2::classname(), [
                            'data' => \yii\helpers\ArrayHelper::map(\backend\models\CategoriaP::find()->all(), 'id', 'nombre'),
                            'options' =>
                                ['prompt' => 'Categoría',

                                    'onchange' => '
                        $.post("index.php?r=producto/registro-unico-ch&cat="' . '+$(this).val(), function( data ){
                            $("#1").html(data);
                        });
                    ',
                                ]
                        ]
                    );
---
SELECT * FROM "producto" WHERE "category_id" = 12
SELECT * FROM "categoria_p"